//
//  Constants.swift
//  KoreanKeyboard
//
//  Created by 홍다희 on 2022/10/04.
//

import Foundation

/// 초성, 중성, 종성에 해당하는 낱글자를 나타내는 상수
enum HangulComponentsTable {

    /// 초성에 해당하는 낱글자
    static let leadingConsonant = [
        "ㄱ", "ㄲ", "ㄴ", "ㄷ", "ㄸ",
        "ㄹ", "ㅁ", "ㅂ", "ㅃ", "ㅅ",
        "ㅅ", "ㅇ", "ㅈ", "ㅉ", "ㅊ",
        "ㅋ", "ㅌ", "ㅍ", "ㅎ"
    ]
    /// 중성에 해당하는 낱글자
    static let vowel = [
        "ㅏ", "ㅐ", "ㅑ", "ㅒ", "ㅓ",
        "ㅔ", "ㅕ", "ㅔ", "ㅗ", "ㅗㅏ",
        "ㅗㅐ", "ㅗㅣ", "ㅛ", "ㅜ", "ㅜㅓ",
        "ㅜㅔ", "ㅜㅣ", "ㅠ", "ㅡ", "ㅡㅣ",
        "ㅣ"
    ]
    /// 종성에 해당하는 낱글자
    static let trailingConsonant = [
        "ㄱ", "ㄲ", "ㄱㅅ", "ㄴ", "ㄴㅈ",
        "ㄴㅎ", "ㄷ", "ㄹ", "ㄹㄱ", "ㄹㅁ",
        "ㄹㅂ", "ㄹㅅ", "ㄹㅌ", "ㄹㅍ", "ㄹㅎ",
        "ㅁ", "ㅂ", "ㅂㅅ", "ㅅ", "ㅆ", "ㅇ",
        "ㅈ", "ㅊ", "ㅋ", "ㅌ", "ㅍ", "ㅎ"
    ]

}
